### Lab 1 (Vismay Gehlot)
Submission instructions: Submit your lab work just like HW1 by going to Canvas and then assignments --> Lab Assignments -->Lab 1 and submitting two files (pdf or html and ipynb)

 This lab assignment has two parts. The first part is practice which you do with your TA and the second part is the Lab assignment which you do yourself following the instructions on the first part.

### Sets in python
A set is a collection of objects which is unordered and unindexed. In Python sets are written with curly brackets. Sets are unordered, so you cannot be sure in which order the items will appear. You cannot access items in a set by referring to an index, since sets are unordered and the objects have no index.
But you can loop through the set items using a for loop, or ask if a specified value is present in a set, by using the in keyword. Read more about it here: https://www.geeksforgeeks.org/sets-in-python/

In [5]:
# Example
fruits = {"apple", "banana", "cherry"}

In [6]:
fruits

{'apple', 'banana', 'cherry'}

In [7]:
fruits[1] # This will give an error as this set of fruits is not ordered.

TypeError: 'set' object is not subscriptable

In [8]:
# If you want to add more items in the list then use the update function.
fruits.update(["orange", "mango", "grapes"])

In [9]:
fruits

{'apple', 'banana', 'cherry', 'grapes', 'mango', 'orange'}

In [10]:
# To know how many items are in the set you can use len().
len(fruits)

6

In [11]:
# You can use  fruits.remove("whatever you want to remove") to remove some items.

# Union and Intersection of sets

In [12]:
# THe union of two sets is another set consisting of all the objects in either set.
a = {1,2,3}
b = {3,4,5}
a.union(b)
a.intersection(b)

{3}

In [13]:
v = {"carrots", "asaparagus", "celery"}
o = {"orange", "cheetos", "cantaloupe", "carrots"}
v.union(o)

{'asaparagus', 'cantaloupe', 'carrots', 'celery', 'cheetos', 'orange'}

In [16]:
v.intersection(o)

{'carrots'}

### Lab 1 Problem 1 (Graded, 10 points)

Create two sets $$A=\{1,3,5,7,9\}$$ and $$ B=\{ 5,7,9,11,13\}$$ We will use union and intersection to find new sets. Use the code A.union(B) and name this new sets as C. Use A.intersection(B) and name this new set as D. Find how many items do these new sets have. Also explain how C and D are calculated.

In [20]:
A = {1, 3, 5, 7, 9}
B = {5, 7, 9, 11, 13}

In [21]:
C = A.union(B)
D = A.intersection(B)

In [23]:
print(C)
print(D)
print(len(C))
print(len(D))

{1, 3, 5, 7, 9, 11, 13}
{9, 5, 7}
7
3

In [ ]:
## C is calculated by combining all unique items in the set and
## merging them into one set, while D is found by taking what both
## sets have in common and creating a new set with those values.

### Lists
A list is a collection which is ordered and changeable. In Python, lists are written with square brackets. More about lists can be here:
https://www.geeksforgeeks.org/python-list/

In [24]:
# Example
fruitlist = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"]

Lists are indexded.  "apple" is in 0th index.

In [25]:
fruitlist[0]

'apple'

You can find a sublist consisting of all the fruits from banana to melon as follows.

In [26]:
fruitlist[1:6]
# first index (so second object in the list) until the 5th index (so 6th object in the list)

['banana', 'cherry', 'orange', 'kiwi', 'melon']

In [27]:
# Creating a list of numbers with for loop
list1 = [ i**2 for i in range(1,9)]# This list will have numbers from 1 squared to 8 squared.

In [30]:
list1

[1, 4, 9, 16, 25, 36, 49, 64]

In [31]:
list1.index(16)# 16 is indexed as 3rd.

3

In [32]:
x = 'abracadabra'
list2 =list(x)
list2

['a', 'b', 'r', 'a', 'c', 'a', 'd', 'a', 'b', 'r', 'a']

In [33]:
list3 = list1 + list2
print(list3)

[1, 4, 9, 16, 25, 36, 49, 64, 'a', 'b', 'r', 'a', 'c', 'a', 'd', 'a', 'b', 'r', 'a']

Join two lists by writting list3 = list1 + list2 and see what happens by printing list 3.

### Lab 1 Problem 2 (Graded, 10 points)
Create a list called I of integers from 1 to 100. From this list, create sublists E of Even integers and O of odd integers from I. Create a list of all the numbers in I that are not multiples 5.

In [35]:
l = [i for i in range(1,101)]

In [37]:
E = []
for i in range(1, 101):
    if (i) % 2 == 0:
        E.append(l[i-1])
print(E)

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100]

In [40]:
O = []
for j in range(1, 101):
    if (j) % 2 == 1:
        O.append(l[j-1])
print(O)

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99]

In [44]:
k=[]
for i in range(1,101):
    if (i) %5!=0:
        k.append(l[i-1])
print(k)

[1, 2, 3, 4, 6, 7, 8, 9, 11, 12, 13, 14, 16, 17, 18, 19, 21, 22, 23, 24, 26, 27, 28, 29, 31, 32, 33, 34, 36, 37, 38, 39, 41, 42, 43, 44, 46, 47, 48, 49, 51, 52, 53, 54, 56, 57, 58, 59, 61, 62, 63, 64, 66, 67, 68, 69, 71, 72, 73, 74, 76, 77, 78, 79, 81, 82, 83, 84, 86, 87, 88, 89, 91, 92, 93, 94, 96, 97, 98, 99]

Let's reload our "world_countries" data from HW1 again and name it wc.

In [51]:
import pandas as pd
wc = pd.read_csv('world_countries.csv', decimal = ',')

In [52]:
# Missing values will interfere our analysis, let's get rid of all the rows 
#that have at least one missing values
wc1 =wc.dropna(how = 'any')
wc1.head()
# if nothing is inputted in the parentheses, the first 5 rows are displayed by default

,Country,Region,Population,Area_in_sqrmiles,Pop. Density (per sq. mi.),Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Birthrate,Deathrate
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,48.0,163.07,700.0,36.0,46.60,20.34
1,Albania,EASTERN EUROPE,3581655,28748,124.6,21.52,4500.0,86.5,15.11,5.22
2,Algeria,NORTHERN AFRICA,32930091,2381740,13.8,31.00,6000.0,70.0,17.14,4.61
3,American Samoa,OCEANIA,57794,199,290.4,9.27,8000.0,97.0,22.46,3.27
4,Andorra,WESTERN EUROPE,71201,468,152.1,4.05,19000.0,100.0,8.71,6.25

In [53]:
wc1.columns

Index(['Country', 'Region', 'Population', 'Area_in_sqrmiles',
       'Pop. Density (per sq. mi.)', 'Infant mortality (per 1000 births)',
       'GDP ($ per capita)', 'Literacy (%)', 'Birthrate', 'Deathrate'],
      dtype='object')

Because  this data set has  10 columns, we will just pick two columns from this data and work on it. We will create a new data set called wl that has only two columns, Country and Literacy(%).

In [54]:
wl=wc1[['Country', 'Literacy (%)']]
wl.head()

           Country  Literacy (%)
0     Afghanistan           36.0
1         Albania           86.5
2         Algeria           70.0
3  American Samoa           97.0
4         Andorra          100.0

Another way we could do this is to list all the columns first and pick the correct indices to represent these two columns.

In [55]:
cols = list(wc1.columns)
cols

['Country',
 'Region',
 'Population',
 'Area_in_sqrmiles',
 'Pop. Density (per sq. mi.)',
 'Infant mortality (per 1000 births)',
 'GDP ($ per capita)',
 'Literacy (%)',
 'Birthrate',
 'Deathrate']

In [56]:
newcols = [cols[0], cols[7]]# As Country and Literacy(%) are 0th and 7th in the list.
# Then we can just do
newwl = wc1[newcols]
newwl.head()

           Country  Literacy (%)
0     Afghanistan           36.0
1         Albania           86.5
2         Algeria           70.0
3  American Samoa           97.0
4         Andorra          100.0

As you can see, wl and newwl are the same so we can just use one of them. Now,  I do not like the % sign in the column name Literacy(%). Let's change it to Literacy.

In [57]:
newdata = newwl.rename(columns={'Literacy (%)': 'Literacy'})
newdata.columns

Index(['Country', 'Literacy'], dtype='object')

Let's sort the Literacy column and answer some questions. Read more about sorting here.
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html

### Lab 1 Problem 3 (Graded, 30 points)
Part 1. Make a list of countries that have 100% literacy rate.

Part 2. Make a list of countries that have less than 40% literacy rate.

In [232]:
# Hint for part 1 and 2: Use the following code to sort the data.
#newdata.sort_values(by=['Literacy'], inplace=True, ascending=False)#

Part 3: Create a new data set  called RG that has only two columns: Region and GDP ($\$$ per capita).

Part 4: How many unique Regions are in RG. (Hint: Create a set of regions).

Part 5: Change the colume name GDP ($\$$ per capita) to GDP.

In [58]:
newdata.sort_values(by=['Literacy'], inplace=True, ascending=False)
newdata.head(8)

            Country  Literacy
54         Denmark      100.0
121     Luxembourg      100.0
4          Andorra      100.0
68         Finland      100.0
154         Norway      100.0
11       Australia      100.0
119  Liechtenstein      100.0
93         Iceland       99.9

In [72]:
## Problem 1 ##

litcountries = []
for i in range(0, len(newdata)):
    if newdata.iloc[i, 1] == 100:
        litcountries.append(newdata.iloc[i, 0])
print(litcountries)

['Denmark ', 'Luxembourg ', 'Andorra ', 'Finland ', 'Norway ', 'Australia ', 'Liechtenstein ']

In [71]:
## Problem 2 ##
weaklitrate = []
l = len(newdata)
for i in range(0, l):
    if newdata.iloc[i, 1] < 40:
        weaklitrate.append(newdata.iloc[i, 0])
print(weaklitrate)

['Somalia ', 'Afghanistan ', 'Guinea ', 'Sierra Leone ', 'Burkina Faso ', 'Niger ']

In [75]:
## Problem 3 ##
list(cols)
newcols = [cols[1], cols[6]]
RG = wc1[newcols]
RG.head()

                                Region  GDP ($ per capita)
0        ASIA (EX. NEAR EAST)                        700.0
1  EASTERN EUROPE                                   4500.0
2  NORTHERN AFRICA                                  6000.0
3  OCEANIA                                          8000.0
4  WESTERN EUROPE                                  19000.0

In [82]:
## Problem 4 ##
RG.drop_duplicates(['Region'], keep='last')

## there are 11 unique regions

                                  Region  GDP ($ per capita)
120  BALTICS                                         11400.0
186  EASTERN EUROPE                                  19000.0
202  SUB-SAHARAN AFRICA                               1500.0
205  NORTHERN AFRICA                                  6900.0
213  WESTERN EUROPE                                  27700.0
214  NORTHERN AMERICA                                37800.0
215              LATIN AMER. & CARIB                 12800.0
216                 C.W. OF IND. STATES               1700.0
217  OCEANIA                                          2900.0
219        ASIA (EX. NEAR EAST)                       2500.0
224  NEAR EAST                                         800.0

In [87]:
## Problem 5 ##
newdata = RG.rename(columns={'GDP ($ per capita)': 'GDP'})
newdata

                                  Region      GDP
0          ASIA (EX. NEAR EAST)             700.0
1    EASTERN EUROPE                        4500.0
2    NORTHERN AFRICA                       6000.0
3    OCEANIA                               8000.0
4    WESTERN EUROPE                       19000.0
6                LATIN AMER. & CARIB       8600.0
7                LATIN AMER. & CARIB      11000.0
8                LATIN AMER. & CARIB      11200.0
9                   C.W. OF IND. STATES    3500.0
10               LATIN AMER. & CARIB      28000.0
11   OCEANIA                              29000.0
12   WESTERN EUROPE                       30000.0
13                  C.W. OF IND. STATES    3400.0
14               LATIN AMER. & CARIB      16700.0
15   NEAR EAST                            16900.0
17               LATIN AMER. & CARIB      15700.0
18                  C.W. OF IND. STATES    6100.0
19   WESTERN EUROPE                       29100.0
20               LATIN AMER. & CARIB       4900.0
22   NORTHERN AMERICA                     36000.0
24               LATIN AMER. & CARIB       2400.0
26   SUB-SAHARAN AFRICA                    9000.0
27               LATIN AMER. & CARIB       7600.0
28               LATIN AMER. & CARIB      16000.0
29         ASIA (EX. NEAR EAST)           18600.0
30   EASTERN EUROPE                        7600.0
36   NORTHERN AMERICA                     29800.0
38               LATIN AMER. & CARIB      35000.0
41               LATIN AMER. & CARIB       9900.0
42         ASIA (EX. NEAR EAST)            5000.0
..                                   ...      ...
179  NEAR EAST                            11800.0
180  SUB-SAHARAN AFRICA                    1600.0
182  SUB-SAHARAN AFRICA                    7800.0
184        ASIA (EX. NEAR EAST)           23700.0
186  EASTERN EUROPE                       19000.0
189  SUB-SAHARAN AFRICA                   10700.0
190  WESTERN EUROPE                       22000.0
191        ASIA (EX. NEAR EAST)            3700.0
194  SUB-SAHARAN AFRICA                    4900.0
195  WESTERN EUROPE                       26800.0
196  WESTERN EUROPE                       32700.0
197  NEAR EAST                             3300.0
198        ASIA (EX. NEAR EAST)           23400.0
199                 C.W. OF IND. STATES    1000.0
201        ASIA (EX. NEAR EAST)            7400.0
202  SUB-SAHARAN AFRICA                    1500.0
204              LATIN AMER. & CARIB       9500.0
205  NORTHERN AFRICA                       6900.0
206  NEAR EAST                             6700.0
207                 C.W. OF IND. STATES    5800.0
208              LATIN AMER. & CARIB       9600.0
211                 C.W. OF IND. STATES    5400.0
212  NEAR EAST                            23200.0
213  WESTERN EUROPE                       27700.0
214  NORTHERN AMERICA                     37800.0
215              LATIN AMER. & CARIB      12800.0
216                 C.W. OF IND. STATES    1700.0
217  OCEANIA                               2900.0
219        ASIA (EX. NEAR EAST)            2500.0
224  NEAR EAST                              800.0

[150 rows x 2 columns]

In [68]:
newdata.iloc[3,1]

100.0

In [241]:
newdata.iloc[8,1]

99.9

In [244]:
newdata.iloc[2,0]

'Norway '

In [245]:
newdata.iloc[5,0]

'Luxembourg '

In [83]:
newdata.index

Int64Index([ 54, 121,   4,  68, 154,  11, 119,  93,  53,  64,
            ...
             21,  97, 180,  73, 188,   0,  86, 183,  31, 151],
           dtype='int64', length=206)